app/controllers/admins/dashboards_controller.rb

SELECT  `admins`.* FROM `admins` ORDER BY `admins`.`id` DESC LIMIT 1
SELECT SUM(`products`.`price`) FROM `products` INNER JOIN `purchase_record_products` ON `purchase_record_products`.`product_id` = `products`.`id` WHERE `products`.`admin_id` = 1
---
  def index
    sold_products = Admin.last.products.joins(:purchase_record_products)
    @total = sold_products.sum(:price)