app/controllers/admins/products_controller.rb

INSERT INTO `products` (`admin_id`, `name`, `description`, `price`, `image`, `created_at`, `updated_at`) VALUES (1, 'ggggg', 'dfasdfa', 33333, 'wineport6.jpg', '2019-12-04 06:59:53', '2019-12-04 06:59:53')
---
  def create
    @product = current_admin.products.build(product_params)
    if @product.save