app/controllers/products/add_to_baskets_controller.rb

INSERT INTO `baskets` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-11-12 05:13:05', '2019-11-12 05:13:05')
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
INSERT INTO `basket_products` (`basket_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 3, '2019-11-12 05:13:05', '2019-11-12 05:13:05')
---
  def create
    basket = current_user.basket || current_user.create_basket
    product = Product.find(params[:product_id])
    basket.basket_products.create!(product_id: product.id)