app/controllers/baskets_controller.rb

  def show
    basket = current_user.basket || current_user.create_basket
    @products = basket.products
    @total_price = @products.sum(:price)
---
SELECT SUM(`products`.`price`) FROM `products` INNER JOIN `basket_products` ON `products`.`id` = `basket_products`.`product_id` WHERE `basket_products`.`basket_id` = 1
SELECT `products`.* FROM `products` INNER JOIN `basket_products` ON `products`.`id` = `basket_products`.`product_id` WHERE `basket_products`.`basket_id` = 1