app/controllers/charges_controller.rb

  def create
    #合計金額を算出
    product_ids = params[:product_ids].map(&:to_i)
    products = current_user.basket.products.where(id: product_ids)
    @total = products.sum(:price)

    ActiveRecord::Base.transaction do
      #中間レコードを１つずつ削除（失敗時は例外を吐く）
      basket_products = current_user.basket.basket_products.where(product_id: product_ids)
      basket_products.each(&:destroy!)
      #purchase_recordのtableへデータ書き込み
      purchase_record = current_user.purchase_record || current_user.create_purchase_record
      ids = product_ids.map { |id| { product_id: id } }
      purchase_record.purchase_record_products.create!(ids)
---
SELECT  `baskets`.* FROM `baskets` WHERE `baskets`.`user_id` = 2 LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT SUM(`products`.`price`) FROM `products` INNER JOIN `basket_products` ON `products`.`id` = `basket_products`.`product_id` WHERE `basket_products`.`basket_id` = 1 AND `products`.`id` IN (42, 1, 2)
SELECT `basket_products`.* FROM `basket_products` WHERE `basket_products`.`basket_id` = 1 AND `basket_products`.`product_id` IN (42, 1, 2)
INSERT INTO `purchase_records` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2019-11-12 05:13:10', '2019-11-12 05:13:10')
INSERT INTO `purchase_record_products` (`purchase_record_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 3, '2019-11-12 05:13:11', '2019-11-12 05:13:11')