app/controllers/products_controller.rb

  def index

    @products = Product.page(params[:page]).per(20)
---
SELECT  `products`.* FROM `products` LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1